{
    "ru": {
        "about": "Этот бот создан, чтобы помочь вам общаться со всем миром. Основная цель этого бота — переводить сообщения с одного канала на другой на любой выбранный вами язык. Один канал может быть ретранслирован на множество других, каждый на определенном языке. Чтобы начать использовать этого бота на своих каналах, назначьте его администратором, чтобы он мог читать и писать сообщения. Более того, вы можете пересылать сообщения из канала Telegram моему боту, и он будет переводить их на целевые каналы в зависимости от того, с какого канала вы переслали свое сообщение. Если у вас есть какие-либо вопросы или проблемы, свяжитесь с @lixelv.",
        "delete_prime": "Выберите основной канал для удаления.",
        "delete_target": "Выберите целевой канал для удаления.",
        "enter_link": "Введите ссылку на канал Telegram, например, @lixel_code_en.",
        "chat_not_found": "Чат не найден. Введите действительную ссылку еще раз.",
        "error": "Упс! Что-то пошло не так.",
        "forwarded": "Сообщение было успешно перенаправлено.",
        "help": "Если у вас возникнут какие-либо ошибки, свяжитесь с @lixelv.",
        "lang_changed": "Язык изменен на русский.",
        "language_selected": "Язык выбран.",
        "prime_selected": "Выбран основной канал.",
        "make_bot_admin": "Пожалуйста, предоставьте боту права администратора и повторите попытку.",
        "no_primes": "Прайм-каналы не найдены. Добавьте их с помощью команды /add_prime.",
        "no_targets": "Целевые каналы не найдены.",
        "not_in_prime": "Канал Telegram не добавляется в ваши основные каналы.",
        "primes": "Вот ваши основные каналы:",
        "registration_ended": "Telegram-канал успешно добавлен!",
        "select_language": "Выберите язык.",
        "select_prime": "Выберите основной канал.",
        "show_primes": "Показать все основные каналы.",
        "show_targets": "Показать все целевые каналы.",
        "start": "Привет! Я бот-переводчик. Я буду переводить сообщения с одного канала на другой. Дополнительную информацию см. в /help — командах и /about — описании. Также вы можете изменить свой язык с помощью команды /select_language.",
        "stop": "Вы завершили процесс добавления канала.",
        "targets": "Вот ваши целевые каналы:"
    },
    "en": {
        "about": "This bot was created to help you communicate with the whole world. The main purpose of this bot is to translate messages from one channel to another in any language you choose. A single channel can be retranslated into many others, each in a specific language. To start using this bot on your channels, make it an admin to allow it to read and write messages. Moreover, you can forward messages from a Telegram channel to my bot, and it will translate them to target channels based on which channel you forwarded your message from. If you have any questions or problems, please contact @lixelv.",
        "delete_prime": "Select a prime channel to delete.",
        "delete_target": "Select a target channel to delete.",
        "enter_link": "Enter the link to the Telegram channel, for example, @lixel_code_en.",
        "chat_not_found": "Chat not found, please enter a valid link again.",
        "error": "Oops, something went wrong.",
        "forwarded": "Message was forwarded successfully.",
        "help": "If you encounter any errors, please contact @lixelv.",
        "lang_changed": "Language changed to English.",
        "language_selected": "Language selected.",
        "prime_selected": "Prime channel selected.",
        "make_bot_admin": "Please give the bot admin rights and try again.",
        "no_primes": "No prime channels found. Add some with the command /add_prime.",
        "no_targets": "No target channels found.",
        "not_in_prime": "Telegram channel is not added in your prime channels.",
        "primes": "Here are your prime channels:",
        "registration_ended": "Telegram channel added successfully!",
        "select_language": "Select the language.",
        "select_prime": "Select a prime channel.",
        "show_primes": "Show all prime channels.",
        "show_targets": "Show all target channels.",
        "start": "Hi! I'm a translation bot. I will translate messages from one channel to another. Learn more in /help - commands and /about - description. Also you can change your language with the command /select_language",
        "stop": "You've ended the process of adding a channel.",
        "targets": "Here are your target channels:"
    },
    "de": {
        "about": "Dieser Bot wurde erstellt, um Ihnen bei der Kommunikation mit der ganzen Welt zu helfen. Der Hauptzweck dieses Bots besteht darin, Nachrichten von einem Kanal in einen anderen in einer beliebigen Sprache Ihrer Wahl zu übersetzen. Ein einzelner Kanal kann in viele andere Kanäle übersetzt werden, jeweils in eine bestimmte Sprache. Um diesen Bot auf Ihren Kanälen zu verwenden, machen Sie ihn zum Administrator, damit er Nachrichten lesen und schreiben kann. Darüber hinaus können Sie Nachrichten von einem Telegrammkanal an meinen Bot weiterleiten und er übersetzt sie in Zielkanäle, je nachdem, von welchem ​​Kanal Sie Ihre Nachricht weitergeleitet haben. Wenn Sie Fragen oder Probleme haben, wenden Sie sich bitte an @lixelv.",
        "delete_prime": "Wählen Sie einen Hauptkanal zum Löschen aus.",
        "delete_target": "Wählen Sie einen Zielkanal zum Löschen aus.",
        "enter_link": "Geben Sie den Link zum Telegrammkanal ein, zum Beispiel @lixel_code_en.",
        "chat_not_found": "Chat nicht gefunden, bitte geben Sie erneut einen gültigen Link ein.",
        "error": "Hoppla! Etwas ist schiefgelaufen.",
        "forwarded": "Nachricht wurde erfolgreich weitergeleitet.",
        "help": "Wenn Sie auf Fehler stoßen, wenden Sie sich bitte an @lixelv.",
        "lang_changed": "Sprache wurde auf Deutsch geändert.",
        "language_selected": "Ausgewählte Sprache.",
        "prime_selected": "Hauptkanal ausgewählt.",
        "make_bot_admin": "Bitte geben Sie dem Bot Administratorrechte und versuchen Sie es erneut.",
        "no_primes": "Keine Prime-Kanäle gefunden. Fügen Sie mit dem Befehl /add_prime welche hinzu.",
        "no_targets": "Keine Zielkanäle gefunden.",
        "not_in_prime": "Der Telegrammkanal wurde nicht zu Ihren Hauptkanälen hinzugefügt.",
        "primes": "Hier sind Ihre wichtigsten Kanäle:",
        "registration_ended": "Telegrammkanal erfolgreich hinzugefügt!",
        "select_language": "Wählen Sie die Sprache aus.",
        "select_prime": "Wählen Sie einen Hauptkanal aus.",
        "show_primes": "Alle Hauptkanäle anzeigen.",
        "show_targets": "Alle Zielkanäle anzeigen.",
        "start": "Hallo! Ich bin ein Übersetzungsbot. Ich übersetze Nachrichten von einem Kanal in einen anderen. Mehr dazu unter /help - Befehle und /about - Beschreibung. Außerdem kannst du deine Sprache mit dem Befehl /select_language ändern.",
        "stop": "Sie haben den Vorgang zum Hinzufügen eines Kanals abgeschlossen.",
        "targets": "Hier sind Ihre Zielkanäle:"
    },
    "fr": {
        "about": "Ce bot a été créé pour vous aider à communiquer avec le monde entier. Le but principal de ce bot est de traduire des messages d'un canal à un autre dans la langue de votre choix. Un seul canal peut être retraduit en plusieurs autres, chacun dans une langue spécifique. Pour commencer à utiliser ce bot sur vos canaux, faites-en un administrateur pour lui permettre de lire et d'écrire des messages. De plus, vous pouvez transférer des messages d'un canal Telegram vers mon bot, et il les traduira vers les canaux cibles en fonction du canal à partir duquel vous avez transféré votre message. Si vous avez des questions ou des problèmes, veuillez contacter @lixelv.",
        "delete_prime": "Sélectionnez une chaîne principale à supprimer.",
        "delete_target": "Sélectionnez une chaîne cible à supprimer.",
        "enter_link": "Entrez le lien vers la chaîne Telegram, par exemple, @lixel_code_en.",
        "chat_not_found": "Chat introuvable, veuillez saisir à nouveau un lien valide.",
        "error": "Oups, quelque chose s'est mal passé.",
        "forwarded": "Le message a été transféré avec succès.",
        "help": "Si vous rencontrez des erreurs, veuillez contacter @lixelv.",
        "lang_changed": "Langue changée en français.",
        "language_selected": "Langue sélectionnée.",
        "prime_selected": "Chaîne principale sélectionnée.",
        "make_bot_admin": "Veuillez accorder les droits d'administrateur au bot et réessayer.",
        "no_primes": "Aucune chaîne principale trouvée. Ajoutez-en avec la commande /add_prime.",
        "no_targets": "Aucune chaîne cible trouvée.",
        "not_in_prime": "La chaîne Telegram n'est pas ajoutée à vos chaînes principales.",
        "primes": "Voici vos principales chaînes :",
        "registration_ended": "Chaîne Telegram ajoutée avec succès !",
        "select_language": "Sélectionnez la langue.",
        "select_prime": "Sélectionnez une chaîne principale.",
        "show_primes": "Afficher toutes les chaînes principales.",
        "show_targets": "Afficher toutes les chaînes cibles.",
        "start": "Salut! Je suis un robot de traduction. Je traduirai les messages d'un canal à un autre. Apprenez-en plus dans /help - commandes et /about - description. Vous pouvez également changer votre langue avec la commande /select_langue",
        "stop": "Vous avez terminé le processus d'ajout d'une chaîne.",
        "targets": "Voici vos chaînes cibles :"
    },
    "ja": {
        "about": "このボットは、世界中の人々とコミュニケーションをとるために作成されました。このボットの主な目的は、任意の言語で、あるチャンネルから別のチャンネルにメッセージを翻訳することです。1 つのチャンネルを、それぞれ特定の言語で、他の多くのチャンネルに再翻訳できます。チャンネルでこのボットを使い始めるには、ボットを管理者にして、メッセージの読み取りと書き込みを許可してください。さらに、Telegram チャンネルから私のボットにメッセージを転送すると、メッセージを転送したチャンネルに基づいて、ボットがターゲット チャンネルにメッセージを翻訳します。質問や問題がある場合は、@lixelv までお問い合わせください。",
        "delete_prime": "削除するプライム チャンネルを選択します。",
        "delete_target": "削除する対象チャネルを選択します。",
        "enter_link": "Telegram チャンネルへのリンクを入力します (例: @lixel_code_en)。",
        "chat_not_found": "チャットが見つかりません。有効なリンクをもう一度入力してください。",
        "error": "おっと！何かが間違っていた。",
        "forwarded": "メッセージは正常に転送されました。",
        "help": "エラーが発生した場合は、@lixelv までご連絡ください。",
        "lang_changed": "言語が日本語に変更されました。",
        "language_selected": "言語を選択しました。",
        "prime_selected": "プライムチャンネルを選択しました。",
        "make_bot_admin": "ボットに管理者権限を与えて、もう一度お試しください。",
        "no_primes": "プライム チャネルが見つかりません。コマンド /add_prime を使用していくつか追加してください。",
        "no_targets": "対象チャネルが見つかりません。",
        "not_in_prime": "Telegram チャンネルはプライム チャンネルに追加されていません。",
        "primes": "主なチャンネルは次のとおりです:",
        "registration_ended": "Telegram チャンネルが正常に追加されました!",
        "select_language": "言語を選択します。",
        "select_prime": "プライムチャンネルを選択します。",
        "show_primes": "すべてのプライムチャンネルを表示します。",
        "show_targets": "すべてのターゲット チャネルを表示します。",
        "start": "こんにちは！私は翻訳ボットです。あるチャンネルから別のチャンネルにメッセージを翻訳します。詳しくは、/help - コマンドと /about - 説明をご覧ください。また、/select_language コマンドで言語を変更することもできます。",
        "stop": "チャネルの追加プロセスが終了しました。",
        "targets": "ターゲット チャンネルは次のとおりです。"
    },
    "et": {
        "about": "See robot loodi selleks, et aidata teil suhelda kogu maailmaga. Selle roboti põhieesmärk on tõlkida sõnumeid ühest kanalist teise mis tahes teie valitud keeles. Ühe kanali saab ümber tõlkida paljudesse teistesse, millest igaüks on kindlas keeles. Kui soovite seda robotit oma kanalitel kasutada, määrake see administraatoriks, et see saaks sõnumeid lugeda ja kirjutada. Lisaks saate sõnumeid Telegrami kanalilt minu robotile edastada ja see tõlgib need sihtkanaliteks selle põhjal, millisest kanalist oma sõnumi edastasite. Küsimuste või probleemide korral võtke ühendust @lixelv.",
        "delete_prime": "Valige kustutamiseks peamine kanal.",
        "delete_target": "Valige kustutamiseks sihtkanal.",
        "enter_link": "Sisesta Telegrami kanali link, näiteks @lixel_code_en.",
        "chat_not_found": "Vestlust ei leitud, palun sisestage uuesti kehtiv link.",
        "error": "Oops! Midagi läks valesti.",
        "forwarded": "Sõnumi edastamine õnnestus.",
        "help": "Kui ilmnevad vead, võtke ühendust @lixelv.",
        "lang_changed": "Keel on muudetud eesti keeleks.",
        "language_selected": "Valitud keel.",
        "prime_selected": "Valitud kanal.",
        "make_bot_admin": "Andke robotile administraatori õigused ja proovige uuesti.",
        "no_primes": "Peamisi kanaleid ei leitud. Lisage mõned käsuga /add_prime.",
        "no_targets": "Sihtkanaleid ei leitud.",
        "not_in_prime": "Telegrami kanalit ei lisata teie põhikanalitesse.",
        "primes": "Siin on teie peamised kanalid:",
        "registration_ended": "Telegrami kanali lisamine õnnestus!",
        "select_language": "Valige keel.",
        "select_prime": "Valige peamine kanal.",
        "show_primes": "Kuva kõik peamised kanalid.",
        "show_targets": "Kuva kõik sihtkanalid.",
        "start": "Tere! Olen tõlkebot. Tõlgin sõnumid ühest kanalist teise. Lisateavet leiate jaotisest /help - käsud ja /about - kirjeldus. Samuti saate oma keelt muuta käsuga /select_language",
        "stop": "Olete kanali lisamise protsessi lõpetanud.",
        "targets": "Siin on teie sihtkanalid:"
    }
}